class DailyDuas {
  static const List<Map<String, String>> shortDuas = [
    {
      "title": "مناجاة",
      "content":
          "يَا رَبِّ، إنَّ لَنَا فِيكَ أَمَلًا طَوِيلًا، وَإنَّ لَنَا فِيكَ رَجَاءً عَظِيمًا.",
    },
    {
      "title": "ذكر",
      "content":
          "يَا حَيُّ يَا قَيُّومُ، بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ.",
    },
    {
      "title": "دعاء الصباح",
      "content":
          "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ.",
    },
    {
      "title": "طلب المغفرة",
      "content":
          "أَسْتَغْفِرُ اللَّهَ الْعَظِيمَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ وَأَتُوبُ إِلَيْهِ.",
    },
    {
      "title": "تسبيح",
      "content":
          "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحَانَ اللَّهِ الْعَظِيمِ.",
    },
    {
      "title": "توكل",
      "content":
          "حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ.",
    },
    {
      "title": "حماية",
      "content":
          "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ.",
    },
  ];
}
